Mickyleitor/RollerShutterControlPanel/Firmware_ESP8266/lcd.h
    *lcdBuffer += String("    ");

    if (shutterGetStatus(currentShutterIndex) == SHUTTER_STATUS_MOVING_DOWN) {
        *lcdBuffer += LCD_SPECIAL_CHAR_STOP_ARROW;
    } else {
        *lcdBuffer += LCD_SPECIAL_CHAR_DOWN_ARROW;
    }

    *lcdBuffer += String("    >");
}

void pantalla_actualizarMenuConfig(String* lcdBuffer) {
    *lcdBuffer += String(" MENU DE CONFIG ");
    *lcdBuffer += String("<      ");
    *lcdBuffer += LCD_SPECIAL_CHAR_DOWN_ARROW;
    *lcdBuffer += LCD_SPECIAL_CHAR_DOWN_ARROW;
    *lcdBuffer += String("      >");
}

void pantalla_actualizarMenuConfigFechaHora(String* lcdBuffer) {
    *lcdBuffer += String("  CONFIG. HORA  ");
    *lcdBuffer += String("       ");
    *lcdBuffer += LCD_SPECIAL_CHAR_UP_ARROW;
    *lcdBuffer += LCD_SPECIAL_CHAR_DOWN_ARROW;
    *lcdBuffer += String("      >");
}

void pantalla_actualizarMenuConfigFechaHoraAjuste(String* lcdBuffer) {
    struct tm* timeinfo = localtime(&adjustedTime);

    static unsigned long lastFlashMs = 0;
    static bool flashOn              = false;

    if ((millis() - lastFlashMs) > LCD_SLIDE_OR_FLASH_SPEED_MS) {
        lastFlashMs = millis();
        flashOn     = !flashOn;
    }

    auto printField = [&](int value, unsigned long index, int width) {
        bool visible = (currentAdjustedLevelIndex != index) || flashOn;
        if (visible) {
            if (value < 10 && width >= 2) {
                *lcdBuffer += '0';
            }
            *lcdBuffer += String(value);
        } else {
            for (int i = 0; i < width; ++i) {
                *lcdBuffer += ' ';
            }
        }
    };

    // Format: hh:mm dd/mm/yyyy
    printField(timeinfo->tm_hour, 0, 2);
    *lcdBuffer += ':';
    printField(timeinfo->tm_min, 1, 2);
    *lcdBuffer += ' ';
    printField(timeinfo->tm_mday, 2, 2);
    *lcdBuffer += '/';
    printField(timeinfo->tm_mon + 1, 3, 2);
    *lcdBuffer += '/';
    printField(timeinfo->tm_year + 1900, 4, 4);

    *lcdBuffer += "<      ";
    *lcdBuffer += LCD_SPECIAL_CHAR_DOWN_ARROW;
    *lcdBuffer += LCD_SPECIAL_CHAR_UP_ARROW;
    *lcdBuffer += "      >";
}

void pantalla_actualizarMenuConfigZonaHorariaAjuste(String* lcdBuffer) {
    *lcdBuffer += String("ZONA UTC: ");
    *lcdBuffer += String(adjustedTimeZone / 3600);
    *lcdBuffer += String(" h");
    // Add spaces to fill the line.
    while (lcdBuffer->length() < 16) {
        *lcdBuffer += String(" ");
    }
    *lcdBuffer += String("<      ");
    *lcdBuffer += LCD_SPECIAL_CHAR_UP_ARROW;
    *lcdBuffer += LCD_SPECIAL_CHAR_DOWN_ARROW;
    *lcdBuffer += String("    OK>");
}

void pantalla_actualizarMenuConfigVolumen(String* lcdBuffer) {
    *lcdBuffer += String("CONFIG.  VOLUMEN");
    *lcdBuffer += String("       ");
    *lcdBuffer += LCD_SPECIAL_CHAR_UP_ARROW;
    *lcdBuffer += LCD_SPECIAL_CHAR_DOWN_ARROW;
    *lcdBuffer += String("      >");
}

void pantalla_actualizarMenuConfigVolumenAjuste(String* lcdBuffer) {
    *lcdBuffer += String("VOLUMEN:  ");
    // If disabled, show a message
    if (!buzzer_is_enabled()) {
        *lcdBuffer += String(" NO");
    } else {
        uint32_t volumePercentage = (buzzer_get_volume() - buzzer_get_volume_min()) * 100
                                  / (buzzer_get_volume_max() - buzzer_get_volume_min());
        *lcdBuffer += String(volumePercentage);
        *lcdBuffer += String(" %");
    }
    // Add spaces to fill the line.
    while (lcdBuffer->length() < 16) {
        *lcdBuffer += String(" ");
    }
    *lcdBuffer += String("<      ");
    *lcdBuffer += LCD_SPECIAL_CHAR_UP_ARROW;
    *lcdBuffer += LCD_SPECIAL_CHAR_DOWN_ARROW;
    *lcdBuffer += String("    OK>");
}

void pantalla_actualizarMenuConfigDebug(String* lcdBuffer) {
    *lcdBuffer += String("   DEPURACION   ");
    *lcdBuffer += String("       ");
    *lcdBuffer += LCD_SPECIAL_CHAR_UP_ARROW;
    *lcdBuffer += LCD_SPECIAL_CHAR_UP_ARROW;
    *lcdBuffer += String("      >");
}

void pantalla_actualizarMenuConfigDebugSoftRstCount(String* lcdBuffer) {
    *lcdBuffer += String("REINICIOS: ");

    // If the count is greater than 9999, show "9999+".
    uint32_t softResetCount = persistentVars_get_softResetCount();
    if (softResetCount > 9999) {
        *lcdBuffer += String("9999+");
    } else {
        *lcdBuffer += String(softResetCount);
    }
    // Add spaces to fill the line.
    while (lcdBuffer->length() < 16) {
        *lcdBuffer += String(" ");
    }
    *lcdBuffer += String("<               ");
}

void pantalla_actualizarMenuConfigWifi(String* lcdBuffer) {
    *lcdBuffer += String(" CONFIG DE WIFI ");
    *lcdBuffer += String("       ");
    *lcdBuffer += LCD_SPECIAL_CHAR_UP_ARROW;
    *lcdBuffer += LCD_SPECIAL_CHAR_UP_ARROW;
    *lcdBuffer += String("      >");
}

void pantalla_actualizarMenuConfigWifiPassword(String* lcdBuffer) {
    *lcdBuffer += String("PWD: ");

    // If password is larger than 11 characters, truncate it from the
    // left to right, keeping the last 11 characters.
    String truncatedPassword = adjustedPassword;
    if (adjustedPassword.length() > 11) {
        truncatedPassword = truncatedPassword.substring(truncatedPassword.length() - 11);
    }
    *lcdBuffer += truncatedPassword;

    while (lcdBuffer->length() < 16) {
        *lcdBuffer += String(" ");
    }

    const String texts[] = {
        "<      ^^      >", // 0% holding time
        "<     -^^-     >", // 16% holding time
        "<    --^^--    >", // 33% holding time
        "<   ---^^---   >", // 50% holding time
        "<  ----^^----  >", // 66% holding time
        "< -----^^----- >", // 83% holding time
        "<------^^------>"  // 100% holding time
    };
    const unsigned long textsCount = sizeof(texts) / sizeof(texts[0]);

    unsigned long textIndex         = 0;
    const unsigned long holdingTime = millis() - buttonHoldingTimeMs;
    if (buttonHolding() == BUTTON_STATUS_DOWN) {
        textIndex = (holdingTime * textsCount) / LCD_HOLDING_TIME_CONFIRM_MS;
        if (textIndex > textsCount - 1) {
            textIndex = textsCount - 1; // Limit to the last text
        }
    } else {
        textIndex = 0;
    }

    static unsigned long lastFlashMs = 0;
    static bool flashOn              = false;

    if ((millis() - lastFlashMs) > (LCD_SLIDE_OR_FLASH_SPEED_MS / 4)) {
        lastFlashMs = millis();
        flashOn     = !flashOn;
    }

