Mickyleitor/RollerShutterControlPanel/Firmware_ESP8266/lcd.h
    for (unsigned long i = 0; i < 16; i++) {
        if ((i != 7) && (i != 8)) {
            *lcdBuffer += texts[textIndex][i];
        } else {
            if (textIndex != textsCount - 1) {
                if (i == 7) {
                    *lcdBuffer += LCD_SPECIAL_CHAR_UP_ARROW;
                } else {
                    *lcdBuffer += LCD_SPECIAL_CHAR_DOWN_ARROW;
                }
            } else if (flashOn) {
                *lcdBuffer += LCD_SPECIAL_CHAR_DOWN_ARROW;
            } else {
                *lcdBuffer += ' ';
            }
        }
    }
}

void pantalla_actualizarMenuConfigWifiSsid(String* lcdBuffer) {
    *lcdBuffer += String("SSID:");

    String mySSID         = adjustedSSID;
    int adjustedSSIDindex = ESP8266Utils_getIndexBySsid(adjustedSSID);
    if (adjustedSSIDindex < 0) {
        mySSID = "No hay redes";
    }

    static unsigned long lastScrollTime = 0;
    static unsigned int scrollOffset    = 0;

    // Espacio visible para SSID
    const int visibleChars = 11;

    // Añadir separación al final para el efecto loop
    String scrollingSSID = mySSID + "   "; // espacio entre loops

    // Actualizar desplazamiento cada 200ms
    if (millis() - lastScrollTime >= LCD_SLIDE_OR_FLASH_SPEED_MS) {
        lastScrollTime = millis();
        scrollOffset++;
        if (scrollOffset >= scrollingSSID.length()) {
            scrollOffset = 0;
        }
    }

    // Construir ventana deslizante
    String scrolled;
    for (int i = 0; i < visibleChars; ++i) {
        int charIndex  = (scrollOffset + i) % scrollingSSID.length();
        scrolled      += scrollingSSID.charAt(charIndex);
    }

    *lcdBuffer += scrolled;

    // Asegurar longitud mínima de 16
    while (lcdBuffer->length() < 16) {
        *lcdBuffer += " ";
    }

    // Agregar navegación
    *lcdBuffer += String("<     ");
    *lcdBuffer += LCD_SPECIAL_CHAR_UP_ARROW;
    adjustedSSIDindex++;
    if (adjustedSSIDindex == 0) {
        *lcdBuffer += String("  ");
    } else if (adjustedSSIDindex < 10) {
        *lcdBuffer += String("0");
        *lcdBuffer += String(adjustedSSIDindex);
    } else {
        *lcdBuffer += String(adjustedSSIDindex);
    }
    *lcdBuffer += LCD_SPECIAL_CHAR_DOWN_ARROW;
    *lcdBuffer += String("     >");
}

void pantalla_actualizarMenuConfigWifiResultado(String* lcdBuffer) {
    int porcentaje = ESP8266Utils_getWifiConnectionPercentage();
    if (porcentaje > 100) {
        porcentaje = 100; // Limit to 100%
    }
    if (ESP8266Utils_isWifiConnected()) {
        *lcdBuffer += String("WIFI: CONECTADO ");
        *lcdBuffer += String("<            OK>");
    } else {
        int porcentaje = ESP8266Utils_getWifiConnectionPercentage();
        if (porcentaje == 100) {
            *lcdBuffer += String("WIFI:  FALLIDO  ");
        } else {
            *lcdBuffer += String("WIFI:  ESPERE   ");
        }
        *lcdBuffer += String("< [");
        for (int i = 0; i < 10; i++) {
            if (i < (porcentaje / 10)) {
                *lcdBuffer += String("=");
            } else {
                *lcdBuffer += String(" ");
            }
        }
        *lcdBuffer += String("]  ");
    }
}

void pantalla_actualizarMenu(uint8_t selectedMenu) {
    String lcdBuffer = "";
    switch (selectedMenu) {
        case SELECCION_MENU_RELOJ:
            pantalla_actualizarReloj(&lcdBuffer);
            break;
        case SELECCION_MENU_PERSIANA_IZQUIERDA:
            // fall through
        case SELECCION_MENU_PERSIANA_CENTRAL:
            // fall through
        case SELECCION_MENU_PERSIANA_DERECHA: {
            uint8_t currentShutterIndex = (SELECCION_MENU_PERSIANA_TO_INDEX(selectedMenu));
            pantalla_actualizarMenuShutter(&lcdBuffer, currentShutterIndex);
            break;
        }
        case SELECCION_MENU_CONFIG:
            pantalla_actualizarMenuConfig(&lcdBuffer);
            break;
        case SELECCION_MENU_CONFIG_FECHA_HORA:
            pantalla_actualizarMenuConfigFechaHora(&lcdBuffer);
            break;
        case SELECCION_MENU_CONFIG_FECHA_HORA_AJUSTE:
            pantalla_actualizarMenuConfigFechaHoraAjuste(&lcdBuffer);
            break;
        case SELECCION_MENU_CONFIG_ZONA_HORARIA_AJUSTE:
            pantalla_actualizarMenuConfigZonaHorariaAjuste(&lcdBuffer);
            break;
        case SELECCION_MENU_CONFIG_VOLUMEN:
            pantalla_actualizarMenuConfigVolumen(&lcdBuffer);
            break;
        case SELECCION_MENU_CONFIG_VOLUMEN_AJUSTE:
            pantalla_actualizarMenuConfigVolumenAjuste(&lcdBuffer);
            break;
        case SELECCION_MENU_CONFIG_DEBUG:
            pantalla_actualizarMenuConfigDebug(&lcdBuffer);
            break;
        case SELECCION_MENU_CONFIG_DEBUG_SOFT_RST_COUNT:
            pantalla_actualizarMenuConfigDebugSoftRstCount(&lcdBuffer);
            break;
        case SELECCION_MENU_CONFIG_WIFI:
            pantalla_actualizarMenuConfigWifi(&lcdBuffer);
            break;
        case SELECCION_MENU_CONFIG_WIFI_SSID:
            pantalla_actualizarMenuConfigWifiSsid(&lcdBuffer);
            break;
        case SELECCION_MENU_CONFIG_WIFI_PASSWORD:
            pantalla_actualizarMenuConfigWifiPassword(&lcdBuffer);
            break;
        case SELECCION_MENU_CONFIG_WIFI_RESULTADO:
            pantalla_actualizarMenuConfigWifiResultado(&lcdBuffer);
            break;
    }
    pantalla_sendLcdBuffer(lcdBuffer);
}

void pantalla_actualizar(bool showClock, uint8_t wantedMenu) {
    bool isNtpReady = rtc_on_sync();

    // 1) explicit clock request: always show if NTP is ready
    if ((wantedMenu == SELECCION_MENU_RELOJ) && isNtpReady) {
        pantalla_actualizarMenu(SELECCION_MENU_RELOJ);
        return;
    }

    // 2) periodic clock refresh if allowed and NTP is ready
    if (showClock && isNtpReady) {
        static unsigned long lastClockUpdate = 0;
        unsigned long now                    = millis();
        if ((now - lastClockUpdate) >= LCD_CLOCK_UPDATE_INTERVAL_MS) {
            lastClockUpdate = now;
            pantalla_actualizarMenu(SELECCION_MENU_RELOJ);
        }
        return;
    }

    // 3) normal menus (valid and not clock)
    if (wantedMenu < SELECCION_MENU_MAX && (wantedMenu != SELECCION_MENU_RELOJ)) {
        pantalla_actualizarMenu(wantedMenu);
    }
}

